---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportLineweightTableIterator
source: html/a105fda8-b80d-accc-c5cb-0226bf30b667.htm
---
# ExportLineweightTableIterator Methods

Identifies if the iteration has completed.